---
title: "Neevaがサ終するらしい"
date: 2023-06-01
slug: "f48468f4-be3d-4ab0-9336-8c2f20db3221"
description: "さよなら"
draft: false
math: false
toc: false
---
[新興検索エンジンのNeevaが明日サ終する](https://neeva.com/blog/may-announcement)らしいですが個人的に本当に残念です。  

独自インデックスを持つ数少ない新興検索エンジンの一つで、結果のクオリティもそれなりに高かった。  
検索エンジンって本当に閉鎖的な分野だと思っていて、OSSなら外部エンジンからスクレイピングするとか、小規模なエンジンなら大企業に寄生するとかしないとまともなのを提供できないのが現実だと思ってます。  
そこにChatGPTみたいなのも登場してきてますます検索エンジン業界は厳しい状況に突っ込んでるのではないかというのが個人的な予想です。そんな中Neevaはよく頑張った方だと思う。

多分 Frea Search も先はそんなに長くなさそう。個人的なモチベーションは皆無だし所詮スクレイパーなのを1インスタンスに集中させる方針を取ったせいでユーザーを下手に増やせなくなって詰みかけ状態。  
そのうちブロックリストだけuBlacklistの購読可能なリストとして公開予定。サ終するかは後継者が出るか次第だと思う。
